Examinator/src/InformationRegisters/НастройкиПользователейСУО/НастройкиПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователейСУО</name>
  <attributes>
    <name>СкрытьКонтактнуюИнформацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьДополнительныеСведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРассылкуНаАдресЭлектроннойПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьУведомленияОНовыхЛичныхСообщениях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьУведомленияОНовыхСообщенияхФорума</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/НастройкиТемФорумаСУО/НастройкиТемФорумаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиТемФорумаСУО</name>
  <attributes>
    <name>РазделФорума</name>
    <type>
      <types>CatalogRef.РазделыФорумаСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.УчебныеГруппыОО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПросмотра</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Помечена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/НастройкиПользователейСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Процедура ЗаписатьНастройку(Пользователь, ИмяНастройки, ЗначениеНастройки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.НастройкиПользователейСУО.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);

	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		НоваяЗапись = НаборЗаписей.Добавить();
	Иначе
		НоваяЗапись = НаборЗаписей[0];	
	КонецЕсли;
	
	НоваяЗапись.Пользователь = Пользователь;
	НоваяЗапись[ИмяНастройки] = ЗначениеНастройки;
	НоваяЗапись.ДатаИзменения = ТекущаяДатаСеанса();

	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаписатьНастройкиПоУмолчанию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.НастройкиПользователейСУО.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Пользователь.Установить(Справочники.Пользователи.ПустаяСсылка());

	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() <> 0 Тогда
		Возврат;
	КонецЕсли;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	НоваяЗапись.Пользователь = Справочники.Пользователи.ПустаяСсылка();
	
	Для каждого РеквизитРегистра Из Метаданные.РегистрыСведений.НастройкиПользователейСУО.Реквизиты Цикл	
		НоваяЗапись[РеквизитРегистра.Имя] = РеквизитРегистра.ЗначениеЗаполнения;			
	КонецЦикла;
	
	НоваяЗапись.ДатаИзменения = ТекущаяДатаСеанса();

	НаборЗаписей.Записать();	
	
КонецПроцедуры

Функция ПолучитьНастройку(Пользователь, ИмяНастройки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПользователейСУО."+ИмяНастройки+"
		|ИЗ
		|	РегистрСведений.НастройкиПользователейСУО КАК НастройкиПользователейСУО
		|ГДЕ
		|	НастройкиПользователейСУО.Пользователь = &Пользователь";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий();

	Возврат ВыборкаДетальныеЗаписи[ИмяНастройки];
	
КонецФункции

Процедура ЗаполнитьСтруктуруНастроек(Пользователь, Настройки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПользователейСУО.СкрытьКонтактнуюИнформацию,
		|	НастройкиПользователейСУО.ЗапретитьРассылкуНаАдресЭлектроннойПочты,
		|	НастройкиПользователейСУО.СкрытьДополнительныеСведения,
		|	НастройкиПользователейСУО.ЗапретитьУведомленияОНовыхЛичныхСообщениях,
		|	НастройкиПользователейСУО.ЗапретитьУведомленияОНовыхСообщенияхФорума
		|ИЗ
		|	РегистрСведений.НастройкиПользователейСУО КАК НастройкиПользователейСУО
		|ГДЕ
		|	НастройкиПользователейСУО.Пользователь = &Пользователь";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаНастроек = Результат.Выгрузить();

	Если Настройки = Неопределено Тогда
		Настройки = Новый Структура;
	КонецЕсли;
	
	Настройки.Вставить("СкрытьКонтактнуюИнформацию", ТаблицаНастроек[0].СкрытьКонтактнуюИнформацию);
	Настройки.Вставить("ЗапретитьРассылкуНаАдресЭлектроннойПочты", ТаблицаНастроек[0].ЗапретитьРассылкуНаАдресЭлектроннойПочты);
	Настройки.Вставить("СкрытьДополнительныеСведения", ТаблицаНастроек[0].СкрытьДополнительныеСведения);
	
	Настройки.Вставить("ЗапретитьУведомленияОНовыхЛичныхСообщениях", ТаблицаНастроек[0].ЗапретитьУведомленияОНовыхЛичныхСообщениях);
	Настройки.Вставить("ЗапретитьУведомленияОНовыхСообщенияхФорума", ТаблицаНастроек[0].ЗапретитьУведомленияОНовыхСообщенияхФорума);
	
КонецПроцедуры

Функция ПолучитьНастройкуПользователей(Пользователи, ИмяНастройки) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПользователейСУО."+ИмяНастройки+",
		|	НастройкиПользователейСУО.Пользователь
		|ИЗ
		|	РегистрСведений.НастройкиПользователейСУО КАК НастройкиПользователейСУО
		|ГДЕ
		|	НастройкиПользователейСУО.Пользователь В(&Пользователи)";

	Запрос.УстановитьПараметр("Пользователи", Пользователи);

	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

// Веб-кабинет

Процедура ОбновитьДанныеВебКабинета(Отбор) Экспорт
		
	УстановитьПривилегированныйРежим(Истина);
	
	Если Отбор.Найти("Пользователь") = Неопределено Тогда
		Пользователь = Неопределено;
	Иначе
		Пользователь = Отбор.Пользователь.Значение;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.НастройкиТемФорумаСУО.СоздатьНаборЗаписей();
	
	Если ЗначениеЗаполнено(Пользователь) Тогда
		НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	КонецЕсли;
	
	НаборЗаписей.Прочитать();
	
	Для каждого Запись Из НаборЗаписей Цикл
		ВебКабинетСУО.ОбновитьДанныеПользователяВебКабинета(Запись.Пользователь);
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
